presentations/tree-sitter/tea-sitter.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Tea Sitter</title>
<meta name="author" content="Jeetaditya Chatterjee"/>
<link rel="stylesheet" href="../reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="../reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Tea Sitter</h1><h3></h3><h2>By  Jeetaditya Chatterjee</h2><h3><i>I am still salty that the vc module stole my joke</i></h3><p>Press s for speaker notes</p>
</section>

<section>
<section id="slide-org6236dc2">
<h2 id="org6236dc2">What is Tree Sitter?</h2>
<aside class="notes">
<p>
Tree sitter is a parser generator and incremental parsing library that allows
programs to become syntax aware of the programs they are editing.
</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgc686144">
<h2 id="orgc686144">&#x2026; What does that mean?</h2>
<aside class="notes">
<p>
Great question lets break that down
</p>

</aside>
</section>
<section id="slide-org1a1dce4">
<h3 id="org1a1dce4">Parser Generation</h3>
<aside class="notes">
<ul>
<li>Provide some example</li>

</ul>

<p>
essentially a parser generator takes in a context free representation of some
code and then generates some object that can then be used for parsing.
</p>

<p>
In tree sitters case these grammer are a javascript object <b>explain</b>
that is then compiled by the tree-sitter cli tool into a c shared library which can then be
dynamically loaded by libtree-sitter
</p>

</aside>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #b877db;">module</span><span style="color: #c7c9cb; background-color: #232530;">.</span><span style="color: #e95678; font-style: italic;">exports</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #21bfc2;">grammar</span><span style="color: #c7c9cb; background-color: #232530;">({</span>
  <span style="color: #e95678;">name</span>: <span style="color: #fab795;">'hello example'</span><span style="color: #c7c9cb; background-color: #232530;">,</span>

  <span style="color: #e95678;">rules</span>: <span style="color: #c7c9cb; background-color: #232530;">{</span>
    <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">// </span><span style="color: #27d797; background-color: #292b36; font-weight: bold; font-style: italic;">TODO:</span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;"> add the actual grammar rules</span>
    <span style="color: #87ceeb;">source_file</span>: <span style="color: #e95678;">$</span> <span style="color: #b877db; font-style: italic;">=&gt;</span> $<span style="color: #c7c9cb; background-color: #232530;">.</span><span style="color: #f09383; font-style: italic;">hello</span><span style="color: #c7c9cb; background-color: #232530;">,</span>
    <span style="color: #87ceeb;">hello</span>: <span style="color: #e95678;">$</span> <span style="color: #b877db; font-style: italic;">=&gt;</span> <span style="color: #fab795;">"hello rigor"</span>
  <span style="color: #c7c9cb; background-color: #232530;">}</span>
<span style="color: #c7c9cb; background-color: #232530;">})</span><span style="color: #c7c9cb; background-color: #232530;">;</span>
</pre>
</div>
</section>
<section id="slide-orgd4a613e">
<h3 id="orgd4a613e">Incremental Parsing</h3>
<aside class="notes">
<p>
With the parser generated we can now do some cool shit.
I will not be going into a lot of detail how but in essence it starts off by
parsing the tree, it uses a generalised form of LR parsing (which allows it to
deal with ambiguty as well as its robust error handling).
</p>

<p>
after the first parse it does not need to reparse the tree, instead it will walk
the tree and only change the nodes affected. its pretty cool like that (and also
makes it really bloddy fast)
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org51fb5da">
<h2 id="org51fb5da">Ok that&rsquo;s really cool! why should I care?</h2>
<aside class="notes">
<p>
well there are many reasons!
</p>
<ul>
<li><p>
Well now we have an ast to play with
</p>

<p>
this allows us to play with our code structurally and manipulate in terms of
functions, statements and expressions which is something historically was a
privalage only lisp has had.
</p></li>

</ul>

</aside>
<ul>
<li>Well now we have an ast to play with&#x2026;</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgfc1430b">
<h2 id="orgfc1430b">Ok so what does all of this look like?</h2>
<aside class="notes">
<ul>
<li>Switch to editor
<ul>
<li>cool syntax highlighting</li>
<li>show off cool things like structural text objects,</li>
<li>debug mode/ playground :/</li>
<li>structural folding</li>

</ul></li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org294f43e">
<h2 id="org294f43e">Whats next?</h2>
<aside class="notes">
<ul>
<li>road map</li>
<li>Language support</li>
<li>Tree edit</li>
<li>maybe a utils package.</li>

</ul>

</aside>
</section>
</section>
<section>
<section id="slide-org8b6e02b">
<h2 id="org8b6e02b">Some other cool resources</h2>
<aside class="notes">
<p>
Ethans talk on tree edit
the strange loop talk on tree sitter
ublontons talk on emacs tree sitter
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org3a8ec83">
<h2 id="org3a8ec83">Any Questions?</h2>
</section>
</section>
</div>
</div>
<script src="../reveal.js/dist/reveal.js"></script>
<script src="../reveal.js/plugin/markdown/markdown.js"></script>
<script src="../reveal.js/plugin/notes/notes.js"></script>
<script src="../reveal.js/plugin/search/search.js"></script>
<script src="../reveal.js/plugin/zoom/zoom.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,
overview: true,
width: 1200,
height: 1080,

transition: 'slide',
transitionSpeed: 'default',

// Plugins with reveal.js 4.x
plugins: [ RevealMarkdown, RevealNotes, RevealSearch, RevealZoom ],

// Optional libraries used to extend reveal.js
dependencies: [
]

});
</script>
</body>
</html>
